src/DataProcessors/кфкКонструкторAsyncAPI/кфкКонструкторAsyncAPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>кфкКонструкторAsyncAPI</name>
</mdclass:DataProcessor>

src/Documents/кфкВерсияСпецификации/кфкВерсияСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>кфкВерсияСпецификации</name>
  <registerRecords>InformationRegister.кфкВерсииСпецификации</registerRecords>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополняющаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияИсправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВерсииОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DefinedType.кфкКомпонентСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/кфкТипыДанныхСпецификации/кфкТипыДанныхСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкТипыДанныхСпецификации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>Описание</name>
    <comment>description</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <comment>type</comment>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДанных</name>
    <comment>format</comment>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Минимум</name>
    <comment>minimum|minLength|minItems</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Максимум</name>
    <comment>maximum|maxLength|maxItems</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перечисление</name>
    <comment>enum</comment>
    <type>
      <types>CatalogRef.кфкПеречисленияСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражение</name>
    <comment>pattern</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Устарело</name>
    <comment>deprecated</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязательное</name>
    <comment>required</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <comment>default</comment>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.Свойства</types>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БазовыеТипы</name>
    <comment>$ref|allOf</comment>
    <attributes>
      <name>Тип</name>
      <type>
        <types>CatalogRef.кфкТипыДанныхСпецификации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/кфкКонструкторAsyncAPI/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
		Если Реквизит.ТипЗначения.СодержитТип(Тип("ДинамическийСписок")) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтотОбъект, Реквизит.Имя),
				?(Реквизит.Имя = "ВерсииСпецификации", "Спецификация", "Владелец"), Параметры.Спецификация);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыДанныхСпецификации

&НаКлиенте
Процедура ТипыДанныхСпецификацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОткрытьФорму("Справочник.кфкТипыДанныхСпецификации.ФормаОбъекта", Новый Структура("Ключ", ВыбраннаяСтрока),
		ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ВыпуститьВерсию(Команда)

	Комментарий = Ждать ВвестиСтрокуАсинх("", НСтр("ru = 'Комментарий к версии'"), 0, Истина);
	Если Комментарий = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДлительнаяОперация = НачатьВыпускВерсииСпецификации(УникальныйИдентификатор, Параметры.Спецификация, Комментарий);

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Выпуск версии спецификации'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершениеВыпускаВерсии", ЭтотОбъект), ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВерсиюЯМЛ(Команда)

	ТекущиеДанные = Элементы.ВерсииСпецификации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДлительнаяОперация = НачатьФормированиеAsyncAPI(УникальныйИдентификатор, ТекущиеДанные.Ссылка);

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Формирование AsyncAPI'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
		Новый ОписаниеОповещения("ЗавершениеФормированияAsyncAPI", ЭтотОбъект), ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершениеВыпускаВерсии(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;

	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);

		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);

		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не удалось выпустить версию'"));
		КонецЕсли;

		Возврат;

	ИначеЕсли Не ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не удалось выпустить версию: не получен результат'"));
		Возврат;

	КонецЕсли;

	РезультатВыпуска = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если РезультатВыпуска = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не удалось выпустить версию: получен пустой результат'"));
		Возврат;
	КонецЕсли;

	Ошибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатВыпуска, "Ошибки");
	Если Ошибки <> Неопределено И Ошибки.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОтчетаОшибокПроверки(Ошибки));
		Возврат;
	КонецЕсли;

	Успешно = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатВыпуска, "Успешно");
	Если Успешно <> Истина Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не удалось выпустить версию: результат операции не содержит описания ошибки'"));
		Возврат;
	КонецЕсли;

	Элементы.ВерсииСпецификации.Обновить();

КонецПроцедуры

&НаКлиенте
Функция ТекстОтчетаОшибокПроверки(Ошибки)

	СтрокиОшибок = Новый Массив;
	НомерОшибки = 0;
	Для Каждого Ошибка Из Ошибки Цикл
		НомерОшибки = НомерОшибки + 1;
		СтрокиОшибок.Добавить(СтрШаблон(
			НСтр("ru = '%1. %2 — %3: %4'"),
			НомерОшибки,
			Ошибка.Объект,
			ПредставлениеПоляПроверки(Ошибка.ИмяПоля),
			Ошибка.ТекстОшибки));
	КонецЦикла;

	Заголовок = СтрШаблон(
		НСтр("ru = 'Версия не выпущена: исправьте ошибки (%1):'"), Ошибки.Количество());
	Возврат Заголовок + Символы.ПС + СтрСоединить(СтрокиОшибок, Символы.ПС);

КонецФункции

&НаКлиенте
Функция ПредставлениеПоляПроверки(ИмяПоля)

	Представления = Новый Соответствие;
	Представления.Вставить("Код", НСтр("ru = 'Код'"));
	Представления.Вставить("Наименование", НСтр("ru = 'Наименование'"));
	Представления.Вставить("ТипДанных", НСтр("ru = 'Тип данных'"));
	Представления.Вставить("АдресТопика", НСтр("ru = 'Адрес топика'"));
	Представления.Вставить("ИмяКанала", НСтр("ru = 'Имя канала'"));
	Представления.Вставить("ИмяОперации", НСтр("ru = 'Имя операции'"));
	Представления.Вставить("ИмяСообщения", НСтр("ru = 'Имя сообщения'"));
	Представления.Вставить("ИмяСообщенияКанала", НСтр("ru = 'Имя сообщения канала'"));
	Представления.Вставить("ИмяСхемы", НСтр("ru = 'Имя схемы'"));

	Результат = Представления.Получить(ИмяПоля);
	Возврат ?(Результат = Неопределено, ИмяПоля, Результат);

КонецФункции

&НаКлиенте
Процедура ЗавершениеФормированияAsyncAPI(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;

	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Если Результат.Свойство("ИнформацияОбОшибке") И Результат.ИнформацияОбОшибке <> Неопределено Тогда
			СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);

		ИначеЕсли Не ПустаяСтрока(Результат.ПодробноеПредставлениеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);

		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не удалось сформировать AsyncAPI'"));
		КонецЕсли;

		Возврат;

	ИначеЕсли Не ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не удалось сформировать AsyncAPI: не получен результат'"));
		Возврат;

	КонецЕсли;

	Описание = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	ИмяФайла = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Описание, "ИмяФайла");
	ДанныеФайла = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Описание, "ДанныеФайла");
	Если ПустаяСтрока(ИмяФайла) Или ДанныеФайла = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не удалось сформировать AsyncAPI: получен пустой результат'"));
		Возврат;
	КонецЕсли;

	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Диалог.Заголовок = НСтр("ru = 'Выберите файл'");
	ПараметрыСохранения.Диалог.Фильтр = "Файл YAML (*.yaml)|*.yaml";
	ФайловаяСистемаКлиент.СохранитьФайл(Новый ОписаниеОповещения("СохранитьФайлYAMLЗавершение", ЭтотОбъект),
		ПоместитьВоВременноеХранилище(ДанныеФайла), ИмяФайла, ПараметрыСохранения);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлYAMLЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПолученныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьВыпускВерсииСпецификации(ИдентификаторФормы, Спецификация, Комментарий)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выпуск версии спецификации'");

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Документы.кфкВерсияСпецификации.СформироватьВерсиюСпецификации", Спецификация, Комментарий);

КонецФункции

Функция НачатьФормированиеAsyncAPI(УникальныйИдентификатор, ВерсияСпецификации)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование AsyncAPI'");

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"кфкРаботаСоСпецификациями.СформироватьAsyncAPIВерсии", ВерсияСпецификации);

КонецФункции

#КонецОбласти
